Criação do banco de dados 
Convertido para csv pelo https://www.convertcsv.com/sql-to-csv.htm

In [ ]:
#CREATE TABLE Jogadores (
 #nomejogador VARCHAR(100),
 #salariojogador DECIMAL(10, 2),
  #nomedotime VARCHAR(100),
  #nomeestado VARCHAR(100)
#);
#INSERT INTO Jogadores (nomejogador, salariojogador, nomedotime, nomeestado)
#VALUES ('Cristiano', 1000000.00, 'Real Madrid', 'Espanha');

#INSERT INTO Jogadores (nomejogador, salariojogador, nomedotime, nomeestado)
#VALUES ('Messi', 950000.00, 'Barcelona', 'Espanha');

#INSERT INTO Jogadores (nomejogador, salariojogador, nomedotime, nomeestado)
#VALUES ('Neymar', 850000.00, 'PSG', 'França');

#INSERT INTO Jogadores (nomejogador, salariojogador, nomedotime, nomeestado)
#VALUES ('Salah', 700000.00, 'Liverpool', 'Inglaterra');

#INSERT INTO Jogadores (nomejogador, salariojogador, nomedotime, nomeestado)
#VALUES ('Mbappé', 750000.00, 'PSG', 'França');

In [2]:
import pandas as pd
enade = pd.read_csv("tabela jogadores.csv")

In [3]:
enade.head()

  nomejogador  salariojogador   nomedotime  nomeestado
0   Cristiano       1000000.0  Real Madrid     Espanha
1       Messi        950000.0    Barcelona     Espanha
2      Neymar        850000.0          PSG      França
3       Salah        700000.0    Liverpool  Inglaterra
4      Mbappé        750000.0          PSG      França

In [8]:
enade = enade.dropna()

In [11]:
enade['salarioanual'] = ['100000000.0', '2023298282.0', '202000000000.0', '2102166321132.0', '10000000000000.0']

In [12]:
enade.head()

  nomejogador  salariojogador   nomedotime  nomeestado      salarioanual
0   Cristiano       1000000.0  Real Madrid     Espanha       100000000.0
1       Messi        950000.0    Barcelona     Espanha      2023298282.0
2      Neymar        850000.0          PSG      França    202000000000.0
3       Salah        700000.0    Liverpool  Inglaterra   2102166321132.0
4      Mbappé        750000.0          PSG      França  10000000000000.0

In [13]:
enade['nomejogador'] = enade['nomejogador'].str.upper()

In [14]:
enade.head()

  nomejogador  salariojogador   nomedotime  nomeestado      salarioanual
0   CRISTIANO       1000000.0  Real Madrid     Espanha       100000000.0
1       MESSI        950000.0    Barcelona     Espanha      2023298282.0
2      NEYMAR        850000.0          PSG      França    202000000000.0
3       SALAH        700000.0    Liverpool  Inglaterra   2102166321132.0
4      MBAPPÉ        750000.0          PSG      França  10000000000000.0

In [15]:
estatisticas = enade.describe()
print(estatisticas)

       salariojogador
count         5.00000
mean     850000.00000
std      127475.48784
min      700000.00000
25%      750000.00000
50%      850000.00000
75%      950000.00000
max     1000000.00000

In [16]:
jogadores_acima_200k = enade.loc[enade['salariojogador'] > 200000.0, ['nomejogador', 'nomedotime']]
print(jogadores_acima_200k)

  nomejogador   nomedotime
0   CRISTIANO  Real Madrid
1       MESSI    Barcelona
2      NEYMAR          PSG
3       SALAH    Liverpool
4      MBAPPÉ          PSG

In [18]:
jogadores_mg = enade.loc[enade['nomeestado'] == 'França', ['nomejogador', 'salariojogador']]
print(jogadores_mg)

  nomejogador  salariojogador
2      NEYMAR        850000.0
4      MBAPPÉ        750000.0

In [22]:
jogadores_com_u = enade.loc[enade['nomejogador'].str.contains('u', case=False), ['nomejogador', 'nomedotime']]
print(jogadores_com_u)

Empty DataFrame
Columns: [nomejogador, nomedotime]
Index: []

In [25]:
jogadores_ordenados = enade[['nomejogador', 'salariojogador', 'nomedotime']].sort_values(by='salariojogador', ascending=False)
print(jogadores_ordenados)

  nomejogador  salariojogador   nomedotime
0   CRISTIANO       1000000.0  Real Madrid
1       MESSI        950000.0    Barcelona
2      NEYMAR        850000.0          PSG
4      MBAPPÉ        750000.0          PSG
3       SALAH        700000.0    Liverpool

In [26]:
jogadores_ordenados = enade[['nomejogador', 'salariojogador', 'nomedotime']].sort_values(by='salariojogador', ascending=True)
print(jogadores_ordenados)

  nomejogador  salariojogador   nomedotime
3       SALAH        700000.0    Liverpool
4      MBAPPÉ        750000.0          PSG
2      NEYMAR        850000.0          PSG
1       MESSI        950000.0    Barcelona
0   CRISTIANO       1000000.0  Real Madrid

In [27]:
quantidade_por_time = enade['nomedotime'].value_counts()
print(quantidade_por_time)

nomedotime
PSG            2
Real Madrid    1
Barcelona      1
Liverpool      1
Name: count, dtype: int64

In [28]:
media_salarial_por_time = enade.groupby('nomedotime')['salariojogador'].mean()
print(media_salarial_por_time)

nomedotime
Barcelona       950000.0
Liverpool       700000.0
PSG             800000.0
Real Madrid    1000000.0
Name: salariojogador, dtype: float64